'''
Моделировать очередь, в качестве элементов которой могут использоваться целые числа и символы.
Операции: добавление элемента, удаление элемента, печать элементов очереди.

Создать класс-потомок, который содержит процедуру сортировки элементов очереди (числа по возрастанию, символы по алфавиту).
Числа и символы не могут идти в очереди вперемешку,
то, какой тип элементов будет присутствовать в очереди определяется при ее инициализации.
Дальше при попытке добавления в очередь данных, которые не предусмотрены должна выводиться ошибка.
'''

class Deque:

    def __init__(self):
        pass

    def __repr__(self):
        pass

    def addRight(self):
        pass

    def addLeft(self):
        pass

    def delElement(self):
        pass


